import pandas as pd
import random
import numpy as np

firstname = ['赵', '钱','孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许'
    , '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云' \
    , '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍' \
    , '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时' \
    , '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪' \
    , '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项' \
    , '祝', '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭', '梅', '盛' \
    , '林', '刁', '钟', '丘', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍', '虞', '万', '支', '柯', '昝', '管' \
    , '卢', '莫', '经', '房', '裘', '缪', '干', '解', '应', '宗', '丁', '宣', '贲', '邓', '单', '杭', '洪', '包', '诸', '左' \
    , '石', '崔', '吉', '钮', '龚', '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '荀', '羊', '於', '惠', '甄', '曲', '家', '封' \
    , '芮', '羿', '储', '靳', '汲', '邴', '糜', '松', '井', '段', '富', '巫', '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷', '车' \
    , '侯', '宓', '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫', '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武' \
    , '符', '刘', '景', '詹', '束', '龙', '叶', '幸', '司', '韶', '郜', '黎', '蓟', '薄', '印', '宿', '白', '怀', '蒲', '台', '从' \
    , '鄂', '索', '咸', '籍', '赖', '卓', '蔺', '屠', '蒙', '池', '乔', '阴', '郁', '胥', '能', '苍', '双', '闻', '莘', '党', '翟' \
    , '谭', '贡', '劳', '逢', '逄', '姬', '申', '扶', '堵', '冉', '宰', '郦', '雍', '璩', '桑', '桂', '濮', '牛', '寿', '通', '边' \
    , '扈', '燕', '冀', '郏', '浦', '尚', '农', '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾' \
    , '鱼', '容', '向', '古', '易', '慎', '戈', '廖', '庚', '终', '暨', '居', '衡', '步', '都', '耿', '满', '弘', '匡', '国', '文' \
    , '寇', '广', '禄', '阙', '东', '欧', '殳', '沃', '利', '蔚', '越', '夔', '隆', '师', '巩', '厍', '聂', '晁', '勾', '敖', '融' \
    , '冷', '訾', '辛', '阚', '那', '简', '饶', '空', '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯', '相', '查' \
    , '荆', '红', '游', '竺', '权', '逯', '盖', '益', '桓', '公', '万俟', '司马', '上官', '欧阳', '夏侯', '诸葛', '闻人', '东方', \
             '赫连', '皇甫', '尉迟', '公羊', '澹台', '公冶', '宗政', '濮阳', '淳于', '单于', '太叔', '申屠', '公孙', '仲孙', '轩辕', \
             '令狐', '钟离', '宇文', '长孙', '慕容', '鲜于', '闾丘', '司徒', '司空', '亓官', '司寇', '仉督', '子车', '颛孙', '端木', \
             '巫马', '公西', '漆雕', '乐正', '壤驷', '公良', '拓拔', '夹谷', '宰父', '谷粱', '晋楚', '阎法', '汝鄢', '涂钦', '段干', \
             '百里', '东郭', '南门', '呼延', '归海', '羊舌', '微生', '岳帅', '缑亢', '况后', '有琴', '梁丘', '左丘', '东门', '西门', \
             '商牟', '佘佴', '伯赏', '南宫', '墨哈', '谯笪', '年爱', '阳佟', '第五', '言福']
secondname = ['诚易', '轩熙', '影', '翎穆', '颖', '御聆', '安金', '安', '铭白', '端', '克', '洛浩', '磊安', '枫', '云凌', '白木',
              '陌茗', '欧', '傲寒', '安尊', '致宫', '涛澈', '欧和', '许以', '尤', '彬野', '木霄', '晗熙', '纶行', '叶', '枫周', '景妍'
    , '陆津', '圣景', '斌风', '锦浩', '泷', '瑕', '澈', '御颜', '艾风', '韩泽', '冲', '傲樱', '江玉', '苏', '佑傲', '霖凌', '宇轩',
              '赵姗', '诤辰', '陆潇', '泽杰', '策辰', '宇苏', '迩辰', '泺铭', '冥漠', '伊', '晨致', '傲离', '辰辉', '枫炫', '亦欧',
              '陆', '元文', '家浩', '岩江', '钧辰', '鸣学', '幂纪', '力莫', '伊堇', '朋虞', '野锡', '安盛', '池冽', '俊之', '金伊',
              '岩亦', '川宫', '御苏', '顺', '谦', '俊盛', '熙端', '月霏', '亦川', '月', '高纪', '圣水', '希墨', '里昕', '雨白', '亮萧'
    , '叶', '泺', '宫', '金昊', '赵叶', '程伊', '瑕以']


def namegen():
    name = firstname[random.randint(0, len(firstname) - 1)] + secondname[random.randint(0, len(secondname) - 1)]
    return name


def gen():
    nums=int(input())
    swap = []
    reg = []
    sp = np.array(pd.read_excel(r'E:\generator\专业.xls', usecols=[1, 2]))
    metadat=pd.read_excel(r'E:\generator\专业.xls', usecols=[2])
    print(metadat)
    print(sp)
    for i in range(nums):
        temp=[]
        r = random.randint(0, 9999)
        cat = str(r)
        te = random.randint(16, 19)
        while te * 10000 + r in reg:
            r = random.randint(0, 9999)
            cat = str(r)
            te = random.randint(16, 19)
        reg.append(te * 10000 + r)
        idcardNo = str(0) * (4 - len(cat)) + cat
        gradID = str(2220) + str(te) + str(0) * (4 - len(cat)) + cat
        spnum=random.randint(0,len(sp)-1)
        classname=sp[spnum][1]+str(2000+te)+"-"+str(random.randint(1,4))
        temp.append(gradID)
        temp.append(namegen())
        temp.append(classname)
        temp.append(spnum)
        for i in range(3):
                    temp.append(str(round(np.random.normal(75, 10, size=None), 0)))
        swap.append(temp)
    dat=pd.DataFrame(swap)
    dat.to_csv(r'E:\Project2\datarev\studat.csv',index=None,header=None,encoding='gbk',sep=' ')
    metadat.to_csv(r'E:\Project2\datarev\speciality.csv',encoding='gbk',index=None,header=None)
    print(dat)


gen()